       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
         77 WS-YEAR   PIC 9(4) COMP.
         77 WS-RESULT PIC 9    COMP.
         77 WS-Q      PIC 9(4) COMP.
         77 WS-R400   PIC 9(4) COMP.
         77 WS-R100   PIC 9(4) COMP.
         77 WS-R4     PIC 9(4) COMP.
       PROCEDURE DIVISION.
       LEAP.
         DIVIDE WS-YEAR BY 400 GIVING WS-Q REMAINDER WS-R400
         DIVIDE WS-YEAR BY 100 GIVING WS-Q REMAINDER WS-R100
         DIVIDE WS-YEAR BY 4   GIVING WS-Q REMAINDER WS-R4
      
         IF (WS-R400 = 0 OR (WS-R4 = 0 AND WS-R100 NOT = 0))
           MOVE 1 TO WS-RESULT
         ELSE
           MOVE 0 TO WS-RESULT
         END-IF.
       LEAP-EXIT.
         EXIT.
