       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVERSE-STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STRING  PIC X(64).

       PROCEDURE DIVISION.
       REVERSE-STRING.
           MOVE FUNCTION REVERSE(FUNCTION TRIM(WS-STRING)) TO WS-STRING.